logs/fio-diskseq/bridge-operator/000/log002.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;97273;379;86237;0;0;0.000000;0.000000;92;54100;2608.196330;5815.373413;1.000000%=96;5.000000%=97;10.000000%=102;20.000000%=105;30.000000%=107;40.000000%=112;50.000000%=116;60.000000%=134;70.000000%=185;80.000000%=211;90.000000%=11206;95.000000%=14745;99.000000%=27656;99.500000%=30801;99.900000%=35913;99.950000%=36962;99.990000%=39059;0%=0;0%=0;0%=0;95;54103;2611.815731;5815.242350;10752;1765888;100.000000%;97911.766082;149205.013619;0.255114%;5.159098%;7443;0;220;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;8.60%;72.92%;0.11%;0.00%;0.00%;0.02%;0.01%;5.48%;10.74%;2.12%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;10;1531;0;0;57;97517;97574;61.44%;slaves;13;29413;0;26;77;302023;302464;99.48%;sda;13;29413;0;26;77;302023;302464;99.48%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=9040: Wed Nov 22 16:25:01 2023
  write: IOPS=379, BW=95.0MiB/s (99.6MB/s)(8192MiB/86237msec); 0 zone resets
    clat (usec): min=92, max=54100, avg=2608.20, stdev=5815.37
     lat (usec): min=95, max=54103, avg=2611.82, stdev=5815.24
    clat percentiles (usec):
     |  1.00th=[   97],  5.00th=[   98], 10.00th=[  103], 20.00th=[  106],
     | 30.00th=[  108], 40.00th=[  113], 50.00th=[  117], 60.00th=[  135],
     | 70.00th=[  186], 80.00th=[  212], 90.00th=[11207], 95.00th=[14746],
     | 99.00th=[27657], 99.50th=[30802], 99.90th=[35914], 99.95th=[36963],
     | 99.99th=[39060]
   bw (  KiB/s): min=10752, max=1765888, per=100.00%, avg=97911.77, stdev=149205.01, samples=171
   iops        : min=   42, max= 6898, avg=382.47, stdev=582.83, samples=171
  lat (usec)   : 100=8.60%, 250=72.92%, 500=0.11%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=5.48%, 20=10.74%, 50=2.12%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.26%, sys=5.16%, ctx=7443, majf=0, minf=220
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=95.0MiB/s (99.6MB/s), 95.0MiB/s-95.0MiB/s (99.6MB/s-99.6MB/s), io=8192MiB (8590MB), run=86237-86237msec

Disk stats (read/write):
    dm-0: ios=10/1531, merge=0/0, ticks=57/97517, in_queue=97574, util=61.44%, aggrios=13/29413, aggrmerge=0/26, aggrticks=77/302023, aggrin_queue=302464, aggrutil=99.48%
  sda: ios=13/29413, merge=0/26, ticks=77/302023, in_queue=302464, util=99.48%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;408522;1595;20534;0;0;0.000000;0.000000;36;223540;624.523993;4134.574982;1.000000%=37;5.000000%=39;10.000000%=39;20.000000%=40;30.000000%=41;40.000000%=42;50.000000%=44;60.000000%=45;70.000000%=45;80.000000%=46;90.000000%=61;95.000000%=69;99.000000%=15925;99.500000%=16187;99.900000%=51642;99.950000%=86507;99.990000%=119013;0%=0;0%=0;0%=0;36;223540;624.583632;4134.573085;147456;490496;100.000000%;408750.829268;119229.213086;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.160717%;13.027809%;2510;0;86;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;84.05%;12.32%;0.01%;0.02%;0.01%;0.02%;0.12%;0.19%;0.29%;2.84%;0.03%;0.09%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;1215;60;0;0;42929;21393;64322;91.19%;slaves;32912;1238;9;4;946458;25845;972333;99.52%;sda;32912;1238;9;4;946458;25845;972333;99.52%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=9138: Wed Nov 22 16:25:22 2023
  read: IOPS=1595, BW=399MiB/s (418MB/s)(8192MiB/20534msec)
    clat (usec): min=36, max=223540, avg=624.52, stdev=4134.57
     lat (usec): min=36, max=223540, avg=624.58, stdev=4134.57
    clat percentiles (usec):
     |  1.00th=[    38],  5.00th=[    40], 10.00th=[    40], 20.00th=[    41],
     | 30.00th=[    42], 40.00th=[    43], 50.00th=[    45], 60.00th=[    46],
     | 70.00th=[    46], 80.00th=[    47], 90.00th=[    62], 95.00th=[    70],
     | 99.00th=[ 15926], 99.50th=[ 16188], 99.90th=[ 51643], 99.95th=[ 86508],
     | 99.99th=[119014]
   bw (  KiB/s): min=147456, max=490496, per=100.00%, avg=408750.83, stdev=119229.21, samples=41
   iops        : min=  576, max= 1916, avg=1596.68, stdev=465.74, samples=41
  lat (usec)   : 50=84.05%, 100=12.32%, 250=0.01%, 500=0.02%, 750=0.01%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.12%, 4=0.19%, 10=0.29%, 20=2.84%, 50=0.03%
  lat (msec)   : 100=0.09%, 250=0.02%
  cpu          : usr=0.16%, sys=13.03%, ctx=2510, majf=0, minf=86
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=399MiB/s (418MB/s), 399MiB/s-399MiB/s (418MB/s-418MB/s), io=8192MiB (8590MB), run=20534-20534msec

Disk stats (read/write):
    dm-0: ios=1215/60, merge=0/0, ticks=42929/21393, in_queue=64322, util=91.19%, aggrios=32912/1238, aggrmerge=9/4, aggrticks=946458/25845, aggrin_queue=972333, aggrutil=99.52%
  sda: ios=32912/1238, merge=9/4, ticks=946458/25845, in_queue=972333, util=99.52%